Merenylmz/STM32Codes/ButtonControlExercise/Core/Src/main.c
#include "main.h"
#include <stdio.h>
#include "stm32f4xx.h"


void RCC_Config(void){
	RCC->CR &= ~(1 << 0); //HSI OFF
	RCC->CR |= 1 << 16; // HSE ON
	while(!(RCC->CR & (1 << 17))); //Wait HSE active
	RCC->CR |= 1 << 19;
	RCC->PLLCFGR = 0x00000000; // genel sıfırlama
	RCC->PLLCFGR |= 1 << 22; // PLL Source HSE
	RCC->PLLCFGR |= 1 << 2;// PLL_M

	RCC->PLLCFGR |= 168 << 6; //PLL_N

	RCC->CFGR |= (5 << 10);
	RCC->CFGR |= (4 << 13);
	FLASH->ACR = (1 << 8) | (1 << 9) | (1 << 10) | 5;


	RCC->PLLCFGR &= ~(1 << 12);//PLL_N
	//RCC->PLLCFGR |= 1 << 17;

	RCC->CR |= 1 << 24;
	while(!(RCC->CR & (1 << 25)));

	RCC->CFGR &= ~(1 << 0);
	RCC->CFGR |= (1 << 1);
	while(!(RCC->CFGR & (1 << 1)));

}


void GPIO_Config(void){
	RCC->AHB1ENR = (uint32_t)0x00000009;

	GPIOD->MODER = (uint32_t)0x55000000;
	GPIOD->OTYPER = (uint32_t)0x00000000;
	GPIOD->OSPEEDR = (uint32_t)0x000000C3;
	GPIOD->PUPDR = (uint32_t)0x00000000;
}

void delay(volatile uint32_t num){
	while(num--);
}

int main(void)
{
	RCC_Config();
	SystemCoreClockUpdate();

	GPIO_Config();
	int counter = 0;
	int re = 0;


  while (1)
  {
	  if ((GPIOA->IDR & 0x00000001)) {
		while(GPIOA->IDR & 0x00000001);
		delay(1680000);
	 // Sayacı bir arttır

		if (counter == 4) {
			  re = 1;
			  counter--;
		} else {
			counter ++;
		}
		printf("\n%d", counter);
	  }

	  if (re == 1) {
		  GPIOD->ODR &= ~(1 << (15 - counter));
		  counter--;
	  } else {
		  counter = counter % 4;
		  GPIOD->ODR |= (1 << (12 + counter));
	  }


  }
}

